app/Views/mahasiswa/dashboard.php

SELECT *
FROM `rencana_studi`
WHERE `nim` = '2101005'
---
                <?php
                $rencanaStudiModel = new \App\Models\RencanaStudiModel();
                $nim = session()->get('nim');
                $rencanaStudi = $rencanaStudiModel->where('nim', $nim)->findAll();