app/Controllers/Admin/DosenController.php

    public function index()
    {
        // Disable cache untuk halaman ini
        $this->response->setHeader('Cache-Control', 'no-store, no-cache, must-revalidate, max-age=0');
        $this->response->setHeader('Pragma', 'no-cache');

        // Auto-sync: Cek dan perbaiki sinkronisasi data
        $syncResult = $this->autoSyncData();

        // Get database connection
        $db = \Config\Database::connect();

        // Get paginated data with fresh query
        $data['dosen'] = $this->dosenModel->orderBy('nidn', 'ASC')->paginate(10);
        $data['pager'] = $this->dosenModel->pager;

        // Get total count with fresh query
        $data['total'] = $db->table('dosen')->countAll();
---
SELECT *
FROM `dosen`
ORDER BY `nidn` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `dosen`
SELECT COUNT(*) AS `numrows` FROM `dosen`