app/Controllers/Admin/JadwalController.php

SELECT `jadwal`.*, `mata_kuliah`.`nama_mata_kuliah`, `mata_kuliah`.`kode_mata_kuliah`, `mata_kuliah`.`sks`, `ruangan`.`nama_ruangan`, `dosen`.`nama` as `nama_dosen`
FROM `jadwal`
JOIN `mata_kuliah` ON `mata_kuliah`.`id_mata_kuliah` = `jadwal`.`id_mata_kuliah`
JOIN `ruangan` ON `ruangan`.`id_ruangan` = `jadwal`.`id_ruangan`
JOIN `dosen` ON `dosen`.`nidn` = `jadwal`.`nidn`
ORDER BY `jadwal`.`id` ASC
SELECT COUNT(*) AS `numrows` FROM `jadwal`
---
    public function index()
    {
        // Disable cache
        $this->response->setHeader('Cache-Control', 'no-store, no-cache, must-revalidate, max-age=0');
        $this->response->setHeader('Pragma', 'no-cache');

        $db = \Config\Database::connect();

        // Get paginated data
        $builder = $db->table('jadwal')
            ->select('jadwal.*, mata_kuliah.nama_mata_kuliah, mata_kuliah.kode_mata_kuliah, mata_kuliah.sks, ruangan.nama_ruangan, dosen.nama as nama_dosen')
            ->join('mata_kuliah', 'mata_kuliah.id_mata_kuliah = jadwal.id_mata_kuliah')
            ->join('ruangan', 'ruangan.id_ruangan = jadwal.id_ruangan')
            ->join('dosen', 'dosen.nidn = jadwal.nidn')
            ->orderBy('jadwal.id', 'ASC');

        $data['jadwal'] = $builder->get()->getResultArray();
        $data['total'] = $db->table('jadwal')->countAll();