app/Controllers/Admin/MahasiswaController.php

    public function index()
    {
        // Disable cache untuk halaman ini
        $this->response->setHeader('Cache-Control', 'no-store, no-cache, must-revalidate, max-age=0');
        $this->response->setHeader('Pragma', 'no-cache');

        // Auto-sync: Cek dan perbaiki sinkronisasi data
        $syncResult = $this->autoSyncData();

        // Get database connection
        $db = \Config\Database::connect();

        // Get paginated data with fresh query
        $data['mahasiswa'] = $this->mahasiswaModel->orderBy('nim', 'ASC')->paginate(10);
        $data['pager'] = $this->mahasiswaModel->pager;

        // Get total count with fresh query
        $data['total'] = $db->table('mahasiswa')->countAll();
---
SELECT *
FROM `mahasiswa`
ORDER BY `nim` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`
SELECT COUNT(*) AS `numrows` FROM `mahasiswa`