app/Controllers/Admin/RuanganController.php

    public function index()
    {
        // Disable cache
        $this->response->setHeader('Cache-Control', 'no-store, no-cache, must-revalidate, max-age=0');
        $this->response->setHeader('Pragma', 'no-cache');

        $db = \Config\Database::connect();

        $data['ruangan'] = $this->ruanganModel->orderBy('id_ruangan', 'ASC')->paginate(10);
        $data['pager'] = $this->ruanganModel->pager;
        $data['total'] = $db->table('ruangan')->countAll();
---
SELECT *
FROM `ruangan`
ORDER BY `id_ruangan` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `ruangan`
SELECT COUNT(*) AS `numrows` FROM `ruangan`