app/Views/admin/dashboard.php

                                <div class="d-flex justify-content-between align-items-center">
                                    <div>
                                        <h6>Total Mahasiswa</h6>
                                        <h2><?= (new \App\Models\MahasiswaModel())->countAll() ?></h2>
---
SELECT COUNT(*) AS `numrows` FROM `mahasiswa`

                                <div class="d-flex justify-content-between align-items-center">
                                    <div>
                                        <h6>Total Dosen</h6>
                                        <h2><?= (new \App\Models\DosenModel())->countAll() ?></h2>
---
SELECT COUNT(*) AS `numrows` FROM `dosen`

                                <div class="d-flex justify-content-between align-items-center">
                                    <div>
                                        <h6>Total Ruangan</h6>
                                        <h2><?= (new \App\Models\RuanganModel())->countAll() ?></h2>
---
SELECT COUNT(*) AS `numrows` FROM `ruangan`

                                <div class="d-flex justify-content-between align-items-center">
                                    <div>
                                        <h6>Total Jadwal</h6>
                                        <h2><?= (new \App\Models\JadwalModel())->countAll() ?></h2>
---
SELECT COUNT(*) AS `numrows` FROM `jadwal`