app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = '2101005'
 LIMIT 1
SELECT *
FROM `mahasiswa`
WHERE `nim` = '2101005'
 LIMIT 1
---
    public function authenticate()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();

        if ($user && password_verify($password, $user['password'])) {
            $sessionData = [
                'id_user' => $user['id_user'],
                'username' => $user['username'],
                'nama_user' => $user['nama_user'],
                'role' => $user['role'],
                'logged_in' => true
            ];

            // Get additional info based on role
            if ($user['role'] == 'mahasiswa') {
                $mahasiswaModel = new MahasiswaModel();
                $mahasiswa = $mahasiswaModel->where('nim', $username)->first();