app/Models/RencanaStudiModel.php

SELECT `rencana_studi`.*, `jadwal`.`nama_kelas`, `jadwal`.`hari`, `jadwal`.`jam`, `mata_kuliah`.`nama_mata_kuliah`, `mata_kuliah`.`kode_mata_kuliah`, `mata_kuliah`.`sks`, `ruangan`.`nama_ruangan`, `dosen`.`nama` as `nama_dosen`
FROM `rencana_studi`
JOIN `jadwal` ON `jadwal`.`id` = `rencana_studi`.`id_jadwal`
JOIN `mata_kuliah` ON `mata_kuliah`.`id_mata_kuliah` = `jadwal`.`id_mata_kuliah`
JOIN `ruangan` ON `ruangan`.`id_ruangan` = `jadwal`.`id_ruangan`
JOIN `dosen` ON `dosen`.`nidn` = `jadwal`.`nidn`
WHERE `rencana_studi`.`nim` = '2101005'
---
    public function getRencanaStudiByMahasiswa($nim)
    {
        return $this->select('rencana_studi.*, jadwal.nama_kelas, jadwal.hari, jadwal.jam,
                             mata_kuliah.nama_mata_kuliah, mata_kuliah.kode_mata_kuliah, mata_kuliah.sks,
                             ruangan.nama_ruangan, dosen.nama as nama_dosen')
            ->join('jadwal', 'jadwal.id = rencana_studi.id_jadwal')
            ->join('mata_kuliah', 'mata_kuliah.id_mata_kuliah = jadwal.id_mata_kuliah')
            ->join('ruangan', 'ruangan.id_ruangan = jadwal.id_ruangan')
            ->join('dosen', 'dosen.nidn = jadwal.nidn')
            ->where('rencana_studi.nim', $nim)
            ->findAll();