app/Controllers/Mahasiswa/HasilStudiController.php

    public function index()
    {
        $nim = session()->get('nim');
        $rencanaStudiModel = new RencanaStudiModel();
        $nilaiMutuModel = new NilaiMutuModel();

        $rencanaStudi = $rencanaStudiModel->getRencanaStudiByMahasiswa($nim);

        // Calculate IPK
        $totalNilaiMutu = 0;
        $totalSks = 0;

        foreach ($rencanaStudi as &$rs) {
            if ($rs['nilai_huruf']) {
                $nilaiMutu = $nilaiMutuModel->find($rs['nilai_huruf']);
---
SELECT *
FROM `nilai_mutu`
WHERE `nilai_mutu`.`nilai_huruf` = 'B-'